export const sum = ["外销仔猪利润(万元)","肥猪批次死亡率(%)",
    "内调仔猪利润(万元)","外销7kg小种猪利润(万元)","肥猪利润(万元)","月度批次空返率(%)",
    "后备母猪死亡数(头)","后备母猪淘汰数(头)","完结批次总头数(头)","哺乳死亡率(%)","肥猪死亡率(%)",
    "断配猪10天发情数(头)","35天前配种数(头)","空怀数(头)","流产数(头)","月度批次流产率(%)",
    "经产母猪淘汰数(头)","其中：零胎母猪淘汰数(头)","经产母猪死亡数(头)","经产母猪死亡率(%)",
    "母猪上产床(头)","114天前配种数(头)","其中：已损失头数(头)","分娩窝数(头)","后备死亡率(%)",
    "产活仔总数(头)","30天死亡数(头)","哺乳转保数(头)","肥猪死亡数(头)","肥猪批次死亡数(头)","肥猪上市头数(头)","其中：提前上市数(头)",
    "其中：提前上市数(头)","其中：上市次品数(头)","兽药采购金额(万元)","兽药耗用金额(万元)","饲料采购数量(吨)",
    "饲料耗用数量(吨)"];
export const avg = ["外销仔猪均价(元/头)","内调仔猪均价(元/头)","单斤标准成本(元/斤)","肥猪平均销售价格(元/斤)",
    "外销7kg小种猪均价(元/头)","后备淘汰率(%)","完结批次利用率(%)",
    "完结批次死亡率(%)","断配猪10天发情率(%)",
    "胎产总仔数(头)","胎产活仔(头)",
    "30天死亡率(%)","35天受孕率(%)",
    "上市正品率(%)","提前上市猪占比(%)","肥猪料肉比(kg)","肥猪平均销售体重(斤/头)"];
export const end = ["195日龄以上后备(头)","超280日龄未配(头)","超49天空怀母猪(头)","超30日龄仔猪存栏(头)",
    "兽药库存金额(万元)","兽药库存天数(天)","饲料库存数量(吨)","饲料库存天数(天)"];
export const intNumber = ["后备母猪死亡数(头)","后备母猪淘汰数(头)","完结批次总头数(头)","断配猪10天发情数(头)",
    "35天前配种数(头)","空怀数(头)","流产数(头)","经产母猪淘汰数(头)","其中：零胎母猪淘汰数(头)","经产母猪死亡数(头)",
    "母猪上产床(头)","114天前配种数(头)","其中：已损失头数(头)","分娩窝数(头)","PSY","30天死亡数(头)","肥猪死亡数(头)",
    "肥猪上市头数(头)","其中：提前上市数(头)","其中：上市次品数(头)","195日龄以上后备(头)","超280日龄未配(头)","超49天空怀母猪(头)",
    "超30日龄仔猪存栏(头)"]
export const preNumber = ["后备死亡率(%)","后备淘汰率(%)","完结批次利用率(%)","完结批次死亡率(%)","断配猪10天发情率(%)",
    "35天受孕率(%)","月度批次空返率(%)","月度批次空返率(%)","经产母猪淘汰率(%)","经产母猪死亡率(%)","配种分娩率(%)",
    "哺乳死亡率(%)","猪苗次品率(%)","30天死亡率(%)","肥猪死亡率(%)","肥猪批次死亡率(%)","上市正品率(%)","提前上市猪占比(%)",
    ]
export const positiveNumber = ["外销仔猪均价(元/头)","内调仔猪均价(元/头)","外销7kg小种猪均价(元/头)",
    "7KG仔猪成本(元/头)","后备淘汰率(%)","完结批次利用率(%)","完结批次死亡率(%)",
    "断配猪10天发情率(%)","35天受孕率(%)","月度批次空返率(%)","月度批次流产率(%)","配怀舍母猪日均耗料(kg)",
    "配种分娩率(%)","哺乳死亡率(%)","猪苗次品率(%)","30天死亡率(%)","肥猪死亡率(%)","分娩舍母猪日均耗料(kg)",
    "兽药耗用金额","上市正品率(%)","提前上市猪占比","肥猪料肉比","兽药库存金额(万元)"]
export const disabledRow = ["总利润(万元)","7KG仔猪成本(元/头)","后备母猪死亡数(头)","后备淘汰率(%)","单斤销售成本(元/斤)",
    "空怀数(头)","流产数(头)","经产母猪淘汰率(%)","经产母猪死亡数(头)","母猪上产床(头)","114天前配种数(头)","其中：已损失头数(头)",
    "配种分娩率(%)","产活仔总数(头)","30天死亡数(头)","PSY","肥猪死亡数(头)","上市正品率(%)",
    "提前上市猪占比(%)"]